Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་འཇིག་རྟེན་འདྲེན་པ་ལ། །རབ་ཏུ་མགུ་བས་ཕྱག་བྱས་སོ།
en: The Buddha, leader of the world.

source: །དམ་པའི་ཆོས་དང་ཚོགས་གཙོ་དང་། །རྒྱལ་བས་བསྔགས་པའི་བསླབ་པ་དང་། །ཏིང་ངེ་འཛིན་དང་བགེད་པ་དང་། །བག་ཡོད་པ་ལ་ཕྱག་བྱས་སོ།
en: They worshiped the excellent Dharma, The best of assemblies, learning praised by the Victor, Meditation, giving, And carefulness.

source: །དེ་བས་བདག་ལ་ཕན་འདོད་པའམ།
en: Thus, those who wish for

source: །བདག་ཉིད་ཆེན་པོ་མངོན་འདོད་པས།
en: Profit or majesty for themselves

source: །སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་ལ། །བཀུར་སྟི་བྱོས་ལ་སྐྱབས་སུ་དེང་།
en: Should honor the Buddha, the Dharma, and the community And seek refuge in them.

source: །འདི་ནི་དེ་ཉིད་གཟིགས་པ་ཡིས།
en: These are praised by the Seer of the Truth

source: །འཇིག་རྟེན་ན་ནི་སྐྱབས་སུ་བསྔགས།
en: As the true refuges in the world. They give every kind of happiness

source: །གནོད་པ་རྣམས་ཀྱིས་སྐྲག་པ་ལ།
en: To those who are frightened by harm.

source: །བདེ་བ་ཀུན་ནི་རབ་སྦྱིན་མཛད།
en: Those who wish for liberation should always rely on

source: །ཆོས་ཀྱི་རྒྱལ་པོ་ཉི་མའི་གཉེན།
en: The greatest thing consistent with the Dharma,

source: །སངས་རྒྱས་བསྟན་པ་ཆོས་ཀྱི་ནི། །བདག་ཉིད་ཆེན་པོར་མཆོག་གྱུར་ལ།
en: Which is the teaching of the king of the Dharma,

source: །ཐར་པ་འདོད་པས་རྟག་ཏུ་བསྟེན།
en: Descendant of the sun, the Buddha.

source: །ཀེ་ནའི་བུའི་ཚིགས་སུ་བཅད་པ་རྫོགས་སོ།། །།
en: The verses of Kaineya are completed. II. The Town of Kāśi, Barley Porridge

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་ཀ་ཤི་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ཏེ། ཀ་ཤིའི་ཚོང་རྡལ་དུ་བྱོན་ཏོ། །ཀ་ཤིའི་ཚོང་རྡལ་དེ་ན་སྔོན་འདྲེག་མཁན་བྱེད་བྱེད་པ་རབ་ཏུ་བྱུང་བ་ཕ་སྤད་གཉིས་ཤིག་ཡོད་པ་ལས།
en: Thereupon the Blessed One, traveling through the country of Kāśi, went to the town of Kāśi. In the town of Kāśi, there were a father and son who had originally been barbers but had gone forth.

source: བུས་སྨྲས་པ། ཕ་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཡུལ་ཀ་ཤིའི་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ནས་གཙུག་ལག་ཁང་དུ་བྱོན་པ་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་སྐུ་མཉེལ་གྱིས།
en: The son said, “Father, the Blessed One has come to the monastery, having traveled in the country of Kāśi with the community of his disciples.

source: མ་ལ་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ནས་ཐུག་ལ་སྤྱན་དྲང་ན། དེ་ལ་ཅི་ཁྱོད་ཐུག་པ་སྟ་གོན་བྱེད་དམ། འོན་ཏེ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་འདྲེན།
en: Since the Blessed One and the community of monks are fatigued, let us now invite the Blessed One and the community of his disciples for a meal of barley porridge. And so, will you prepare rice soup or invite the community of monks?”

source: དེས་སྨྲས་པ། ཁྱོད་སོང་ལ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲོངས་ཤིག །ང་ནི་ཐུག་པ་སྟ་གོན་བྱེད་དོ།
en: “You should go and invite the community of monks,” said the father. “I will prepare rice soup.”

source: །དེས་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་སོ།
en: The son then invited the community of monks.

source: །དེ་ཡང་མེ་ལོང་ཞིག་ཐོགས་ནས་ཚོང་དུས་སུ་སོང་བ་ལས།
en: The father went to the market, carrying a mirror with him.

source: དེས་དེ་ན་ཚོང་དཔོན་ཞིག་སྐྲ་དང་ཁ་སྤུ་རིང་བ་མཐོང་ནས།
en: There he saw the head of a guild, who had long hair and a long beard.

source: དེས་དེ་ལ་མེ་ལོང་བསྟན་པ་དང་། དེས་སྨྲས་པ། འཕགས་པ་འདི་ལྟ་བུའི་མཁྱེན་པ་ཡང་མངའ་འམ།
en: When he showed him the mirror, he asked, “O noble one, do you have such a skill?”

source: དེས་སྨྲས་པ་ཡོད་དོ།
en: “Yes, I do,” he answered.

source: །གལ་ཏེ་མངའ་ན་བྲེགས་ཤིག །དེས་བྲེག་པར་བརྩམས་པ་དང་ཁྱིམ་བདག་གཉིད་ལོག་ནས་བྲེགས་ཟིན་པ་དང་སད་དོ།
en: “If you do, please shave me.” When he began to shave him, the householder fell asleep and woke up when the shaving was done.

source: །དེས་སྨྲས་པ། འཕགས་པ་བྲེགས་ལགས་སམ།
en: “O noble one,” he asked, “have you finished shaving?”

source: ཁྱིམ་བདག་བྲེགས་ཟིན་ཏོ།
en: “Yes, householder, I have.”

source: །དེ་མགུ་ནས་སྨྲས་པ། འཕགས་པ་བདག་ལྷག་པར་གློ་བ་དགའ་བས་ཁྱོད་མཆོག་ཅི་བཞེད་པ་དོན་ཏོ། །དེས་སྨྲས་པ།
en: He was delighted and said, “O noble one, as I am quite completely satisfied, I will offer you what you most wish.”

source: ཁོ་བོས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ནས་ཐུག་ལ་སྤྱན་དྲངས་ཀྱིས་ནས་ཐུག་བྱིན་ཅིག །དེས་སྨྲས་པ།
en: He replied, “Since I have invited the community of monks headed by the Buddha for a meal of barley porridge, give me barley porridge.” “Noble one, is such a thing as barley porridge suitable for you?” the householder asked.

source: འཕགས་པ་ནས་ཐུག་ལྟ་ཁྱོད་ཅི་རུང་བཟའ་བ་དང་བཅའ་བ་བསོད་པ་དག་འབུལ་གྱིས་བཞུད་ལ་སྤྱན་དྲོངས་ཤིག །ནད་མེད་པར་གྱུར་ཅིག་ཅེས་སྨྲས་ནས་དེ་སོང་ངོ་།
en: “I will offer you a fine meal. Go and invite them!” Having saluted him, he departed.

source: །དེ་ནས་ཁྱིམ་བདག་དེས་གཙང་ཞིང་བསོད་པ་ཞེས་བྱ་བ་ནས། དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནས་བཟའ་བ་དང་བཅའ་བ་བསོད་པ་དག་བྲིམས་པ་ན།
en: Then the householder prepared a pure and fine meal . . . the Blessed One sat on the seat prepared for him in front of the community of monks.

source: དགེ་སློང་རྣམས་ཀྱིས་བསམས་པ། བདག་ཅག་ངན་པ་ལ་མགྲོན་དུ་བོས་ན་ཁ་ཟས་བསོད་པ་འདི་བདག་ཅག་གིས་ཇི་ལྟར་བླང་ཞེས་དེ་རྣམས་ཀྱིས་མ་བླངས་པའི་སྐབས་དེ།
en: When the fine meal was distributed there, the monks wondered, “Since we have been invited for plain food, how can we accept this fine meal?” They did not accept it.

source: དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གལ་ཏེ་ངན་པ་ལ་མགྲོན་དུ་བོས་ལ་ཁ་ཟས་བསོད་པ་རྙེད་ན་ལོངས་སྤྱད་པར་བྱ་སྟེ།
en: When the monks reported this matter to the Blessed One, the Blessed One said, “If one is invited for plain food and obtains a fine meal, one can consume it.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། ཉེས་པ་གང་བྱུང་བ་དེ་ནི་དགེ་སློང་དག་རིགས་དང་མཐུན་པའི་སྣོད་ཐོགས་པ་ལས་གྱུར་གྱིས།
en: The Blessed One thought, “The fault that occurred in this case was that monks retain tools related to their families.

source: དེ་ལྟ་བས་ན་དགེ་སློང་གིས་རང་གི་བཟོ་བསྟན་པར་མི་བྱ།
en: Thus, a monk should not demonstrate his skill.

source: རིགས་དང་མཐུན་པའི་སྣོད་ཀྱང་བསྲེལ་བར་མི་བྱའོ།
en: He should not keep tools related to his family, either.

source: །སྲེལ་ན་འགལ་ཚབས་ཅན་དུ་འགྱུར་རོ།
en: If he keeps them, he becomes guilty of an offense.

source: །སྔོན་སྨན་པ་ཡིན་ན་གཙའ་ཁབ་ཀྱི་སྣོད་སྲེལ་བ་དང་། སྔོན་ཡི་གེ་པ་ཡིན་ན་རམ་ཕྱིས་སྲེལ་བ་དང་། བཟོ་མཁན་རབ་ཏུ་བྱུང་ན་ཁབ་རལ་སྲེལ་བ་ནི་མ་གཏོགས་སོ།
en: There are exceptions: a former physician keeping a box of scalpels, a former scribe keeping an ink bottle, and a tailor keeping a needle case.” III. Khādyaka in Pāpā

source: །བཅོམ་ལྡན་འདས་གྱད་ཡུལ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ཏེ་སྡིག་ཅན་དུ་བྱོན་ནས་སྡིག་ཅན་ན་སྲིན་བུ་པད་པའི་ཚལ་སྟུག་པོ་ན་བཞུགས་སོ།
en: The Blessed One, traveling through the country of Malla, arrived at Pāpā and stayed in the dense forest of Jalūkā near Pāpā.

source: །སྡིག་ཅན་ན་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའི་ཞང་པོ་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་ཞེས་བྱ་བ་ཞིག་གནས་པ་དེ་ཤིན་ཏུ་མ་དད་པ་ཞིག་སྟེ།
en: There lived a maternal uncle of the venerable Ānanda, who was a high official of the Mallas named Roca. He was not very pious.

source: བཅོམ་ལྡན་འདས་སྡིག་ཅན་གྱི་གྱད་ཡུལ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་ཏེ། སྡིག་ཅན་དུ་བྱོན་ནས་སྡིག་ཅན་ན་སྲིན་བུ་པད་པའི་ཚལ་སྟུག་པོ་ན་བཞུགས་སོ། །ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་གྲོས་བྱ་བར་བརྩམས་པ།
en: When the Mallas in Pāpā heard that the Blessed One, traveling through the country of Malla, had arrived at Pāpā and was staying in the dense forest of Jalūkā near Pāpā, they began to talk among themselves:

source: ཤེས་ལྡན་དག་བཅོམ་ལྡན་འདས་གྱད་ཡུལ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་སྡིག་ཅན་དུ་བྱོན་ནས། སྡིག་ཅན་ན་སྲིན་བུ་པད་པའི་ཚལ་སྟུག་པོ་ན་བཞུགས་སོ།
en: “Sirs, we have heard that the Blessed One, traveling through the country of Malla, has arrived at Pāpā and is staying in the dense forest of Jalūkā near Pāpā.

source: །ཞེས་ཐོས་ཀྱིས། གལ་ཏེ་བདག་ཅག་རེ་རེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ན་གཞན་གྱིས་སྐབས་མི་རྙེད་པར་འགྱུར་བས་ཡེ་ཁྲིམས་ཞིག་བཅའ་བར་བྱ་སྟེ། བདག་ཅག་སུས་ཀྱང་གཅིག་པུས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་བར་མི་བྱ་ཞིང་བདག་ཅག་འདུས་པ་ཁོ་ནས་གདུགས་ཚོད་གསོལ་བར་བྱའོ།
en: Since if each of us offers a meal to the community of monks headed by the Buddha, the others will not have any opportunity, let us make an agreement so that none of us will by himself offer a meal to the community of monks headed by the Buddha, but we will offer a meal together.

source: །བདག་ཅག་ལས་གང་ཞིག་གཅིག་པུ་ཁོ་ནས་གདུགས་ཚོད་གསོལ་ན། དེ་ལ་ཚོགས་ཀྱིས་ཀཱར་ཥཱ་པ་ཎ་དྲུག་བཅུའི་ཆད་པ་གཅད་དོ།
en: If one of us offers a meal by himself, a fine of sixty kārṣāpaṇas shall be imposed on him by our community.”

source: །དེ་ནས་སྡིག་ཅན་གྱི་གྱད་ཐམས་ཅད་འདུས་ནས།
en: Thereupon the Mallas of Pāpā went to the Blessed One together.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་སྡིག་ཅན་གྱི་གྱད་རྣམས་ལ་ཞེས་བྱ་བ་ནས། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When they had sat down to one side, the Blessed One, through talk consistent with the Dharma . . . delighted the Mallas of Pāpā, and then remained silent.

source: །དེ་ནས་སྡིག་ཅན་གྱི་གྱད་རྣམས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་ཅག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon the Mallas of Pāpā rose from their seats, draped their upper robes over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to our offer of a meal at one of our houses tomorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྡིག་ཅན་གྱི་གྱད་རྣམས་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the Mallas of Pāpā by remaining silent.

source: །དེ་ནས་སྡིག་ཅན་གྱི་གྱད་རྣམས་ཀྱིས། བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ། རྗེས་སུ་ཡི་རངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་།
en: Then the Mallas of Pāpā, knowing that the Blessed One had assented by remaining silent, praised and were delighted at the words of the Blessed One, bowed low until their foreheads touched the Blessed One’s feet, rose from their seats, and departed.

source: །གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་ནི་དེ་ཉིད་ན་འདུག་པ་དང་། དེ་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ།
en: Roca, the high official of the Mallas, remained there.

source: འོད་ལྡན་ཅི་ཁྱོད་དད་པར་གྱུར་ཏམ། དེས་སྨྲས་པ།
en: The venerable Ānanda asked him, “Roca, have you become pious?”

source: བདག་དད་པར་ནི་མ་གྱུར་མོད་ཀྱི་འོན་ཀྱང་ཚོགས་ཀྱི་ཁྲིམས་སུ་བཅས་པ་ཞེས་བྱ་བ་ནས། ཀཱར་ཥཱ་པ་ཎ་དྲུག་བཅུའི་ཆད་པས་གཅད་དོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “I have not become pious,” he answered, “but our community made an agreement . . . a fine of sixty kārṣāpaṇas shall be imposed.”

source: །ཁྱོད་ཆད་པས་འཇིགས་ནས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འོངས་པ་ལྟ་ཞིག།།བཙུན་པ་དེ་ལྟ་ལགས་སོ།
en: “You came to see the Blessed One for fear of a fine!” “O honored one, precisely so.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་ཁྲིད་དེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ།
en: The venerable Ānanda then took Roca, the high official of the Mallas, to the Blessed One.

source: གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་འདི་ནི་སངས་རྒྱས་ལ་མངོན་པར་མ་དད། ཆོས་ལ་མ་ལགས། དགེ་འདུན་ལམ་ལགས་ན།
en: Upon their arrival, he said to the Blessed One, “O Honored One, this Roca, the high official of the Mallas, does not believe in the Buddha, the Dharma, or the community.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་འདི་སངས་རྒྱས་ལ་མངོན་པར་དད་ཅིང་ཆོས་དང་དགེ་འདུན་ལ་མངོན་པར་དད་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་ལེགས་པར་བཤད་དུ་གསོལ།
en: May the Blessed One preach the Dharma well so that he will believe in the Buddha, the Dharma, and the community.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the venerable Ānanda by remaining silent.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་གང་ཐོས་པས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་སངས་རྒྱས་ལ་མངོན་པར་དད། ཆོས་དང་དགེ་འདུན་ལ་མངོན་པར་དད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བཤད་པ་མཛད་དོ།
en: Then the Blessed One preached the Dharma to Roca, the high official of the Mallas, so that after listening to it, he would believe in the Buddha, the Dharma, and the community.

source: །དེ་ནས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon Roca, the high official of the Mallas, rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.”

source: འོད་ལྡན་ང་སྔར་སྡིག་ཅན་གྱི་གྱད་རྣམས་ཀྱིས་སྤྱན་དྲངས་ཟིན་ཏོ།
en: “Roca, I have already been invited by the Mallas of Pāpā.”

source: །བཅོམ་ལྡན་འདས་གནང་བར་མཛོད་ཅིག་དང་། ཇི་ལྟར་སྡིག་ཅན་གྱི་གྱད་རྣམས་བཏུབ་པ་དེ་ལྟར་བདག་བགྱིད་དོ།
en: “May the Blessed One assent, and I will make the Mallas of Pāpā allow this.”

source: །འོད་ལྡན་གལ་ཏེ་སྡིག་ཅན་གྱི་གྱད་རྣམས་བཏུབ་ན་དེ་བཞིན་དུ་ངས་ཁྱོད་ལ་གནང་ངོ་།
en: “Roca, if the Mallas of Pāpā allow it, I will thus assent to you.”

source: །དེ་ནས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་ཆས་ནས་སྡིག་ཅན་གྱི་གྱད་རྣམས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། སྡིག་ཅན་གྱི་གྱད་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon Roca, the high official of the Mallas, bowed low until his forehead touched the Blessed One’s feet, rose from his seat, departed, and went to see the Mallas of Pāpā.

source: །ཤེས་ལྡན་དག་རེ་ཞིག་སྡོད་ཅིག་བདག་གིས་ཐོག་མར་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ནས།
en: When he arrived, he said to the Mallas of Pāpā, “Sirs, wait for a while.

source: དེའི་འོག་ཏུ་ཁྱེད་ཅག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ན་དཀའ་བར་མི་འགྱུར་རོ། །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: It will not cause difficulty if I first offer a meal to the Blessed One and the community of monks, and later you also offer a meal to them.”

source: ཁོ་བོ་ཅག་གིས་སྔར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ཟིན་པས་ཁོ་བོ་ཅག་མི་ཉན་ཏོ།
en: “We invited the community of monks headed by the Buddha first,” they replied. “We do not consent to this.”

source: །དེས་སྨྲས་པ། ཇི་སྟེ་མི་བཏུབ་ན་བཅའ་བ་དང་བཏུང་བ་རེ་རེ་ཞིང་བྲིམ་མོ།
en: “If you do not allow this,” he countered, “I will distribute khādyaka and drinks respectively.”

source: །དེ་ན་མ་དད་པ་གང་ཡིན་པ་དེ་དག་གིས་སྨྲས་པ། མི་གནང་ངོ་།
en: Those who were impious there said, “We do not permit this.”

source: །དད་པ་ཅན་གང་ཡིན་པ་དེ་དག་གིས་སྨྲས་པ། ཤེས་ལྡན་དག་འདི་དད་པ་མེད་པ་ཞིག་ལས། འདིས་དགེ་འདུན་མངའ་བའི་ཡོན་དག་འབུལ་བར་འགྱུར་བས་གནང་ངོ་ཞེས་དེ་རྣམས་ཀྱིས་དེ་ལ་གནང་ངོ་།
en: Those who were pious said, “Sirs, since he, being impious, will give offerings to the community, we will give him permission to do so.” Then they did give him permission.

source: །དེ་ནས་དེས་གཡོས་མཁན་དག་བཀུག་སྟེ་བསྒོ་བ།
en: He then called together some cooks.

source: ཤེས་ལྡན་དག་ཁོ་བོས་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་གྱིས་བཅའ་བ་གཅིག་པུ་གང་ཁོ་ནས་འགྲངས་པར་འགྱུར་བ་དེ་ལྟ་བུར་སྟ་གོན་གྱིས་ཤིག །དེས་དྲི་ཞིམ་པོ་སྣ་ཚོགས་ཀྱི་རྫས་ལ་སོགས་པ་དང་ལྡན་པའི་ཡོ་བྱད་རྣམས་ཕོག་པ་དང་། དེ་རྣམས་ཀྱིས་དྲི་ཞིམ་པོ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་རྒྱས་པ་རེ་རེས་རེ་རེ་འགྲངས་པར་འགྱུར་བའི་བཅའ་བ་གང་ཡིན་པ་དག་བྱས་སོ།
en: “Sirs,” he instructed them, “I will provide every ingredient, so prepare khādyaka with which one would be fully satisfied.” He gave them ingredients including various fragrant materials, and they cooked khādyaka with various fragrances, each serving of which would fully satisfy each person.

source: །དེ་ནས་སྡིག་ཅན་གྱི་གྱད་རྣམས་ཀྱིས་དེ་ཉིད་ཀྱི་ནུབ་མོ་ནས་གཙང་ཞིང་བསོད་པའི་ཞེས་བྱ་བ་ནས།
en: Thereupon the Mallas of Pāpā prepared a pure and fine meal during the night . . . .

source: དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: The Blessed One sat on the seat prepared for him in front of the community of monks.

source: །དེ་ནས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་གྱིས་བཅའ་བ་དང་བཏུང་བ་བྲིམ་པར་བརྩམས་པ་དང་། དགེ་སློང་རྣམས་འགྱོད་པས་ལོངས་མ་སྤྱད་དོ།
en: Then Roca, the high official of the Mallas, began to distribute khādyaka and drinks, but the monks did not eat because of some doubts.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཡོན་བདག་ལ་བལྟ་བར་བྱའོ།
en: The Blessed One said, “You should ask for the donor’s consent.”

source: །དགེ་སློང་རྣམས་ཀྱིས་སྡིག་ཅན་གྱི་གྱད་རྣམས་ལ་བལྟས་པ་དང་དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The monks asked for the consent of the Mallas of Pāpā.

source: འཕགས་པ་དག་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་གྱིས་བདག་ཅག་བསླུས་ལགས་ཀྱིས་བཞེས་ཤིག །དེ་ནས་གྱད་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་འོད་ལྡན་གྱིས་བཅའ་བ་བྲིམས་པ་དང་དེ་ཁོ་ནས་དགེ་སློང་རྣམས་འགྲངས་ཏེ།
en: “O noble ones,” they said, “we were deceived by Roca, the high official of the Mallas. Please receive it anyway.” Thereupon Roca, the high official of the Mallas, distributed khādyaka, and the monks were fully satisfied with it.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡོན་བསྔོ་བ་མཛད་དེ་གཤེགས་པས་སྡིག་ཅན་གྱི་གྱད་རྣམས་ཀྱི་ཟས་དེ་དག་ལོངས་མ་སྤྱད་པར་གྱུར་ཏོ།
en: Since the Blessed One had assigned the rewards of the offerings and departed, the food provided by the Mallas of Pāpā was not consumed. IV. Doubts

source: །ཉི་མ་གཞན་ཞིག་ལ་དགེ་སློང་རྣམས་བསོད་སྙོམས་ལ་ཞུགས་པ་དང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་སྨྲས་པ། སངས་རྒྱས་ཚུར་སྤྱོན།
en: On another day, when monks went for alms, brahmins and householders said, “O Buddha, please come!

source: ཆོས་ཚུར་སྤྱོན།
en: O Dharma, please come!

source: དགེ་འདུན་ཚུར་སྤྱོན་འདི་དག་སྣོམས་ཤིག །དགེ་སློང་རྣམས་འགྱོད་པས་མ་བླངས་སོ།
en: O community, please come! Accept this!” The monks did not accept it because of some doubts.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཅི་ཁོ་བོ་ལ་སྦྱིན་ནམ། འོན་ཏེ་བཅོམ་ལྡན་འདས་རྐང་གཉིས་རྣམས་ཀྱི་མཆོག་གང་ཡིན་པ་དེ་ལ་དབུལ་ཞེས་དྲི་བར་བྱའོ། །གལ་ཏེ་བཅོམ་ལྡན་འདས་རྐང་གཉིས་རྣམས་ཀྱི་མཆོག་གང་ཡིན་པ་དེ་ལའོ་ཞེས་སྨྲ་ན་བདག་གིར་མི་བྱའོ།
en: The Blessed One told them, “You should ask, ‘Are you giving it to me or the Blessed One, the best of humans?’ If they say, ‘This is for the Blessed One, the best of humans,’ you should not have it for yourselves.

source: །འོན་ཏེ་བདག་ཅག་གི་སངས་རྒྱས་ནི་ཁྱོད་ཉིད་ལགས་སོ་ཞེས་སྨྲ་ན་བླང་བར་བྱ་སྟེ།
en: But if they say, ‘Our Buddha is none but you,’ you can accept it.

source: །དེ་བཞིན་དུ་ཆོས་འདོད་ཆགས་དང་བྲལ་བ་རྣམས་ཀྱི་མཆོག་གང་ཡིན་པ་དེ་ལའམ་ཞེས་བརྗོད་པར་བྱ་ཞིང་། དགེ་འདུན་ཚོགས་རྣམས་ཀྱི་མཆོག་གང་ཡིན་པ་དེ་ལའམ་ཞེས་རྒྱས་པར་སྦྱར་བར་བྱའོ། །གླེང་གཞི་ནི་མཉན་ཡོད་ནའོ།
en: Likewise, you should ask, ‘Is this for the Dharma, the best of what is free from desire?’ ‘For the community, the best of assemblies?’ . . . .” V.

source: །ཁྱིམ་བདག་ཅིག་གིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བསྲོ་ཁང་ལ་སྤྱན་དྲངས་སོ།
en: Foul Foods A. A Story of the Present about the Great Peacock Charm The following took place in Śrāvastī. A certain householder invited the community of monks headed by the Buddha to a steam bath.

source: །དེའི་ཚེ་ཚེ་དང་ལྡན་པས་རི་ཞེས་བྱ་བ་གཞོན་ནུ་ཐོར་བུ་ལང་ཚོ་ལ་བབ་པ་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པ། བསྙེན་པར་རྫོགས་ནས་རིང་པོ་མ་ལོན་པ། ཆོས་འདུལ་བ་འདིར་འོངས་ནས་རིང་པོ་མ་ལོན་པ། དེས་བསམས་པ། བཅོམ་ལྡན་འདས་ཀྱིས་གང་གིས་ཉུང་ངུ་བྱིན་པ་དང་གང་གིས་མང་དུ་བྱིན་པ་དང་། གང་གིས་བཟང་པོ་བྱིན་པ་དང་། གང་གིས་ཡིད་དགའ་བས་ལས་བྱས་པ་དང་། གང་གིས་རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་རྗེས་སུ་ཡི་རང་བ་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་སྐལ་བ་ཅན་དུ་འགྱུར་རོ་ཞེས་གསུངས་ཀྱིས།
en: At that time, a venerable one named Svāti, who was young, junior, and in his youth, who had newly gone forth and newly been ordained, newly come into this Dharma and Vinaya, thought, “The Blessed One said, ‘Those who give a little, those who give much, those who give excellent things, those who do labor with pleasure, those who are satisfied with a pure mind—all of them share merit.’ So, I will now do labor.” He began to chop wood.

source: མ་ལ་བདག་གིས་ཀྱང་ལས་ཤིག་བྱའོ་སྙམ་ནས་དེས་ཤིང་གཤག་པར་བརྩམས་པ་ལས་ཇི་ཙམ་ན་ཤིང་རུལ་པ་ཞིག་གི་སེར་ཀ་ནས་སྦྲུལ་གདུག་པ་ཞིག་བྱུང་ནས་རྐང་པ་གཡས་པའི་མཐེ་བོ་ལ་ཟིན་པ་དང་། དེ་དུག་གི་ཤུགས་ཀྱིས་བརྒྱ་ལ་ནས་ས་ལ་འགྱེལ་ཏེ་དབུ་བར་སྐྱུག་ཅིང་བཞིན་ཡང་གྱུར། མིག་ཀྱང་གྱུར་ཏེ།
en: Then a poisonous snake emerged from a hole in a rotten piece of wood and bit him on the right big toe. He fainted from the poison, fell on the ground, and foamed at the mouth, his face and eyes distorted.

source: དེ་དེ་ལྟར་སྡུག་བསྔལ་བ་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་མཐོང་ནས་སྨྲས་པ། ཤེས་ལྡན་དག་འདི་ཁྱིམ་བདག་སུ་ཞིག་གི་བུ་ཡིན། གཞན་དག་གིས་སྨྲས་པ། ཆེ་གེ་མོ་ཞིག་གིའོ།
en: Brahmins and householders saw him suffering in such pain and asked each other, “Sirs, which householder’s son is this?”

source: །དེ་དག་གིས་སྨྲས་པ།
en: Some of them answered, “He is So-and-so’s son.”

source: དགེ་སྦྱོང་ཤཱཀྱའི་སྲས་མགོན་མེད་པ་རྣམས་ཀྱི་ནང་དུ་རབ་ཏུ་བྱུང་གི་གལ་ཏེ་རབ་ཏུ་མ་བྱུང་བར་གྱུར་ན་ཉེ་དུ་རྣམས་ཀྱིས་འདི་ལ་དཔྱད་བྱས་པ་ཞིག་ཅེས་བྱ་བའི་སྐབས་དེ་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: They said, “He went forth among those who are helpless, those śramaṇas who are the sons of the Śākyans. If he had not gone forth, his family would have treated him.”

source: སྨན་པ་ལ་དྲིས་ལ་དཔྱད་བྱོས་ཤིག །དགེ་སློང་དག་གིས་སྨན་པ་ལ་དྲིས་པ་དང་། དེས་སྨྲས་པ།
en: When the monks reported this matter to the Blessed One, the Blessed One said, “Ask a physician what to do and treat him.” The monks asked a physician what to do, and he answered, “Noble ones, give him some foul food.”

source: འཕགས་པ་སྦྱར་བའི་ཟས་གསོལ་ཅིག་པའི་སྐབས་དེ་དགེ་སློང་དག་གིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྨན་པས་བསྟན་ན་སྦྱིན་པར་བྱའོ།
en: When the monks reported this to the Blessed One, the Blessed One said, “You can give it to him if the physician prescribed it.”

source: །དགེ་སློང་དག་གིས་ཟས་སྦྱར་བ་ཇི་ལྟ་བུ་ཡིན་པ་མ་ཤེས་ནས། དེ་རྣམས་ཀྱིས་སྨན་པ་ལ་དྲིས་པ་དང་། དེས་སྨྲས་པ།
en: Because the monks did not know what foul food was, they asked the physician.

source: འཕགས་པ་དག་ཁྱེད་ཉིད་ཀྱི་སྟོན་པ་བཅོམ་ལྡན་འདས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ་ཁོ་ན་ཉིད་ཡིན་ཏེ།
en: He answered, “Noble ones, since your Teacher, the Blessed One, is omniscient, one who sees everything, he must know.”

source: དེ་ཉིད་མཁྱེན་ཏོ་ཞེས་པ་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When the monks reported this matter to the Blessed One, the Blessed One said, “Monks, the types of foul food are as follows:

source: དགེ་སློང་དག་ཟས་སྦྱར་བ་ནི་ལྕི་བ་དང་། གཅིན་དང་། ཐལ་བ་དང་སའོ།
en: excrement, urine, ash, and soil.

source: །དེ་ལ་ལྕི་བ་ནི་བྱུང་ནས་རིང་པོ་མ་ལོན་པའི་བེའུ་རྣམས་ཀྱིའོ།
en: Among these, excrement is that of newly born calves.

source: །གཅིན་ཡང་དེ་དག་ཁོ་ནའོ།
en: Urine is that of them too.

source: །ཐལ་བ་ནི་ཤིང་ལྔ་པོ་ཀན་ཙ་ནའི་དང་། ཀ་པི་དྷ་ཀའི་དང་། ཨ་ཤྭཏྠའི་དང་། ཨུ་དུམ་བཱ་རའི་དང་། ནྱ་གྲོ་དྷའིའོ།
en: Ash is that of five kinds of trees, namely, kāñcana, kapītaka, aśvattha, udumbara, and nyagrodha.

source: །ས་ནི་ས་ལས་སོར་བཞིའི་འོག་ནས་ཕྱུང་བའོ།
en: The soil is that which is dug out from a depth of four fingers from the surface of the ground.

source: །འདི་ནི་སྦྱར་བའི་ཟས་ཡིན་ནོ།
en: These are the types of foul food.”

source: །དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པས་རིལ་ཟས་སྦྱར་བ་བྱིན་ན།
en: Thereupon the monks gave foul food to the venerable Svāti, but his health did not return.

source: འོན་ཀྱང་སོས་པར་མ་གྱུར་པའི་སྐབས་དེ་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ང་ལས་རྨ་བྱ་ཆེན་མོའི་རིག་སྔགས་བཟུང་ནས་ཀུན་ཆུབ་པར་བྱས་ཏེ། དགེ་སློང་ས་རི་ལ་བསྲུང་བ་དང་། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། དུག་གཞིལ་བ་དང་། ཆད་པ་སྤང་བ་དང་། དུག་གསད་པ་དང་། མཚམས་གཅད་པ་དང་། ས་བཅིང་བར་ནུས་སམ།
en: When the monks reported this matter to the Blessed One, the Blessed One said, “Ānanda, can you receive the Great Peacock Charm from me, learn it, protect, guard, and defend the monk Svāti, detoxify the poison, remove the harm, counteract the poison, establish a boundary, and bind the ground?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་དུ་གསོལ་མཉན་ཏེ་བགྱིའོ།། །།
en: “May the Blessed One say it. I will do as I hear.”
